# OpenOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
OpenOptions Constructor
OpenOptions Class See Also
---
Constructs a new instance of the options class using default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public OpenOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
OpenOptions()
```

# See Also
OpenOptions Class
Autodesk.Revit.DB Namespace